acc1408/stm8s_osa/main.c
/**
  ******************************************************************************
  * @file    Project/main.c 
  * @author  MCD Application Team
  * @version V2.3.0
  * @date    16-June-2017
  * @brief   Main program body
   ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

//
/* Includes ------------------------------------------------------------------*/

#include "stm8s.h"
#include "stm8s_it.c"
#include <string.h>
#include <math.h>

//#include <math.h>
/* Private defines -----------------------------------------------------------*/

// кол-во микрошагов на оборот
#define microStep1 1000			//кол-во шагов на оборот
#define maxDistCarSP 3100 // максимальное задание
#define minDistCarSP 500 // максимальное задание
#define ConvStepIntoDist 1000 // конвертация шагов в мм
#define CarMinV1 400  // Минимальная скорость для каретки
#define CalibLimitIn_mm 720 // калибровочное расстояние


#define alarm_btn_time_off 5 // время удержания кнопки пуск таймер для отключения
//=====================================
// Параметры двигателя заслонки
#define SliderMicroStep 800 	// Микрошагов на оборот
#define  SliderTimeAccel 1500 // Время ускорения мс
#define  SliderTimeBreak 300  // Время торможения мс
// =================================
#define  SrcMicroStep  400 // Микрошагов на оборот
#define SrcConvStepIntoDist 200 // конвертация шагов в мм для источника
#define SrcDistDown				100		// расстояние опускания вниз для источника в верхней точке



// описание входов шаговых двигатлей
// каретка
#define enStep1  	GPIOF, GPIO_PIN_5
#define clkStep1 	GPIOH, GPIO_PIN_2
#define dirStep1 	GPIOF, GPIO_PIN_7
//---------------------------------
// сигнал ошибки по току
#define AlmStep		GPIOA, GPIO_PIN_6
// Датчика концевиков
// концевика каретки
#define CarFarLimit 	GPIOF, GPIO_PIN_6
#define CarNearLimit 	GPIOH, GPIO_PIN_1
// Зона заслонки 1 м от источника
#define CarCalibLimit GPIOH, GPIO_PIN_3         
// Светодиод зоны заслонки
#define CarCalibLimitLed	GPIOE, GPIO_PIN_6

// Светодиоды ограничений
#define CarFarLimitLed 	GPIOE, GPIO_PIN_5
#define CarNearLimitLed	GPIOE, GPIO_PIN_7

//------------------------------------
// Кнопки
// ручной режим Дальше
#define CarFarBtn 	  GPIOG, GPIO_PIN_5
// ручной режим Ближе
#define CarNearBtn 	  GPIOI, GPIO_PIN_5
// авто старт
#define CarAutoStartBtn GPIOI, GPIO_PIN_3
// калибровка
#define CarCalibBtn GPIOI, GPIO_PIN_4
// Светодиоды кнопок
#define CarFarBtnLed	GPIOC, GPIO_PIN_4
#define CarNearBtnLed 	GPIOC, GPIO_PIN_3
#define CarAutoStartBtnLed	GPIOC, GPIO_PIN_2
#define CarCalibBtnLed	GPIOC, GPIO_PIN_1
// Настройка дистанции
#define CarAutoDistPlusBtn GPIOI, GPIO_PIN_1
#define CarAutoDistMinusBtn GPIOI, GPIO_PIN_2


//=========================================
// заслонка
#define enStep2  	GPIOH, GPIO_PIN_0
#define clkStep2 	GPIOA, GPIO_PIN_3
#define dirStep2 	GPIOA, GPIO_PIN_5
#define calibNoGpio	0,0
// Концевики для заслонки
// заслонка открыта
#define SliderOpenLimit GPIOA, GPIO_PIN_4
// заслонка закрыта
#define SliderCloseLimit 	GPIOA, GPIO_PIN_2


// Индикаторы светодиодов Концевиков
#define SliderOpenLimitLed 	GPIOH, GPIO_PIN_7
#define SliderCloseLimitLed GPIOH, GPIO_PIN_6

// Кнопки настройка Часов

#define SliderHourPlusBtn  	GPIOE, GPIO_PIN_3
#define SliderHourMinusBtn	GPIOE, GPIO_PIN_2

#define SliderMinutePlusBtn GPIOE, GPIO_PIN_1
#define SliderMinuteMinusBtn GPIOE, GPIO_PIN_0

#define SliderTimeStartBtn	GPIOE, GPIO_PIN_4

#define SliderOpenBtn				GPIOG, GPIO_PIN_7

#define SliderCloseBtn			GPIOG, GPIO_PIN_6

// Светодиоды
// Встроенный светодиоды Кнопки
#define SliderOpenBtnLed		GPIOC, GPIO_PIN_6
#define SliderCloseBtnLed		GPIOC, GPIO_PIN_5
#define SliderTimeStartBtnLed GPIOC, GPIO_PIN_7






//============================================
// Источник
#define enStepSrc_3  	GPIOA, GPIO_PIN_1
#define clkStepSrc_3 	GPIOD, GPIO_PIN_4
#define dirStepSrc_3 	GPIOD, GPIO_PIN_6
//----------------------------------------
// Концевики для источника
// источник поднят
#define SrcUpLimit 	GPIOD, GPIO_PIN_7
// источник опущен
#define SrcDownLimit 	GPIOD, GPIO_PIN_5
//----------------------------------------
// Светодиоды концевиков +
#define SrcUpLimitLed 	GPIOH, GPIO_PIN_5
// источник опущен
#define SrcDownLimitLed 	GPIOH, GPIO_PIN_4

// кнопки
// кнопка подъем источника+
#define SrcUpBtn GPIOI, GPIO_PIN_7
// опускание источника
#define SrcDownBtn GPIOI, GPIO_PIN_6
//--------------------------------------
// светодиоды кнопок
// кнопка источник поднят+
#define SrcUpBtnLed GPIOG, GPIO_PIN_1
// источник опущен
#define SrcDownBtnLed GPIOG, GPIO_PIN_0



//========================================
//--------------------------------
// пищалка двери+
#define Buzz 	  	GPIOD, GPIO_PIN_2

// Концевик двери+
#define SwDoorLimit 	GPIOD, GPIO_PIN_3
// Включение обмоток двери +
#define SwDoorCoil   	GPIOG, GPIO_PIN_3
// кнопка общей остановки
//#define StopBtn 		GPIOD, GPIO_PIN_0
#define ResetBtn		GPIOG, GPIO_PIN_4
#define ResetBtnLed GPIOC, GPIO_PIN_0
#define OnOffBtn		GPIOI, GPIO_PIN_0

#define StopBtn		GPIOD, GPIO_PIN_0
#define StopL		  GPIOG, GPIO_PIN_2



/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
									//	*
//***************************************************************
// Описание пинов
#define tm1637_1	GPIOB, GPIO_PIN_3, GPIOB, GPIO_PIN_6
#define tm1637_2	GPIOB, GPIO_PIN_2, GPIOB, GPIO_PIN_6
#define tm1637_3	GPIOB, GPIO_PIN_1, GPIOB, GPIO_PIN_6
#define tm1637_4	GPIOB, GPIO_PIN_0, GPIOB, GPIO_PIN_6
//==================================================
// Пины I2C

#define GPIO_SDA	GPIOB, GPIO_PIN_5
#define GPIO_SCL	GPIOB, GPIO_PIN_4
#define maxRepeatWrite	50



// Окончание пинов
//uint8_t a[]={0x71,0x74,0x07,0x33,0x02};



#define noHandler 0

// Порог быстрой перемотки
#define edgeFastHour 5
#define edgeFastMinute 5



