acc1408/stm8s_osa/main.c
//------------------------------------------------
// Состояние оси подъем источника 
typedef enum
{
	SrcMoveIdle=0,
	SrcMoveUp,
	SrcMoveDown
} ControlSrc_t;

typedef enum
{
	sliderTimerStop,
	sliderTimerRun,
	//sliderTimerReset,
	sliderTimerHold,			//При достижении флага происходит сброс таймера
	sliderTimerInit
} sliderTimerState_t;

// регулятор оборотов
typedef enum
{
	flagModeKalibOff=0,
	flagModeKalibOn,
	flagModeKalibDownRun,
	flagModeKalibUpRun
}flagModeKalib_t;


typedef enum
{
	karet_idle=0,
	karet_up=1,
	karet_down=2,
	karet_stop=3
	
} butKaret_t;
// типы данных для работы с часами
typedef union
{
	uint8_t reg[4];
	struct
	{
		uint8_t s1:4;
		uint8_t s10:4;
		
		uint8_t m1:4;
		uint8_t m10:4;
		
		uint8_t h1:4;
		uint8_t h10:4;
		
		uint8_t day1_7;
	};
} ds3231_reg_t;

//-----------------------------------
// Типы данных для каретки

//----------------------------------

//=======================================
//---------------------------------
// Модуль работы экраны
//---------------------------------
// объекты экрана
tm1637_t 	disp1, // distantice SP
					disp2, // distantice PV
					dispTimer, 
					dispTimerAlarm ;
//---------------------------------
//массив для экранов
char st[15];
//==================================

//----------------------------------
// Структура для работы с шаговыми двигателями
//---------------------------------------------
// структура 
pidW_t 	pidCar,			// Каретка 
				pidSlider, 	// Заслонка
				pidSrc ;		// Источник
//----------------------------------
//========================================
// автовыход из зоны задвижки
typedef enum
{
	CarAutoUpOff,
	CarAutoUpOn
}CarAutoUpMode_t;
//----------------------------------------
// Кнопки управления кареткой
button_t 	Handler_CarFarBtn,
					Handler_CarNearBtn,
					Handler_CarAutoStartBtn,
					Handler_CarCalibBtn,
					Handler_CarAutoDistPlusBtn,
					Handler_CarAutoDistMinusBtn
					;
// кнопки
/*
button_t 	Handler_SrcUpBtn, 
					Handler_SrcDownBtn;
*/
//----------------------------------------
//========================================
// текущие расстояние каретки
int16_t 	distCarSP=718; 
uint8_t		flagDistCarSP=0; 	// флаг кол-ва 
int32_t 	PV_Cur; // текущая дистанция в шагах.
// номер ускорения для дистанции
int16_t		incDistCarSP=0,
					decDistCarSP=0,
					dirDistCarSP=0 // направление
					;		
int16_t		distCarPV;
CarAutoUpMode_t CarAutoUpMode=CarAutoUpOff;
//------------------------------------------
// просто переменные
uint8_t temp_8u;
uint16_t 	temp_16u,
					temp2_16u	;

int32_t temp_32;

typedef enum
{
	stateCarSliderIdle,
	
	stateWaitIdle,
	//------------------
	// Одиночные задачи
	//--------------------
	stateCarManNear,
	//---------------------
	stateCarManFar,
	//----------------------
	stateCarCalib,
	//------------------------
	state_CarAutoStart,
	//------------------------
	state_SrcUp,
	//-------------------------
	state_SrcDown,
	//------------------------
	//state_SrcDownDist, // отвод источник на определенное положение вниз
	//-----------------------
	// Многоцелевые задачи
	//----------------------
	state_SliderOpen,	// конец задачи
	state_SliderOpen_OutZone,
	//state_SliderOpen_OutZone_SrcDownDist,
	//----------------------------
	state_SliderClose,
	state_SliderClose_OutZone,
	//-------------------
	state_AlarmStart,
	state_AlarmStart_SrcUp,
	state_AlarmStart_SrcUp_CarAuto,
	state_AlarmStart_SrcUp_CarAuto_SliderOpen,
	state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone,
	state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone_CarAuto, 

	// отдельные задачи
	// не имеют собственной реализации
	state_OutZone	// отвод каретки из зоны заслонки
	
	
}stateCarSlider_t;



//=========================================
// модуль работы с I2C
I2Csw_gpio_t I2Csw_Gpio;
#define maskTimeMin				0x3F	// маска минут
#define maskTimeFlagAlm		0x40	// Маска флага запуска таймера
#define AT24C32_devAdr		0x57
#define DS3231_devAdr			0x68
#define DS3231_stopTimer  0x9C
#define DS3231_startTimer 0x1C
#define DS3231_control    0x0E


typedef enum
{
	alarmOff=0,
	alarmOn
}alarm_flag_t;

typedef struct
{
	uint32_t s_alm;	// общее кол-во секунд
	int8_t	min_alm;	// задание на таймер
	int8_t	hour_alm;	// кол-во часов
	alarm_flag_t flag_alm;	// наличие флага запуска
	uint8_t cntBtnOff;				// счетчик кнопки запуска таймера
	uint8_t cntBtnOffFlag;		// флаг кнопки запуска таймера
}alarm_t;


uint8_t DS3231_regCntr=DS3231_startTimer;	// регистр управления 
uint8_t adrDS3231=0;
uint8_t DS3231_reg[4];
alarm_t alarm;
uint16_t j;
softTimer_t softTimerUpdate;

uint8_t timerUpdateDisplay=0;
// Состояние
stateCarSlider_t stateCarSlider=stateCarSliderIdle;
//---------------------------
typedef enum
{
	PV_ok,
	PV_error
}PV_flag_t;

typedef enum
{
	SP_ok,
	SP_error
}SP_flag_t;

typedef enum
{
	time_ok,
	time_error
}time_flag_t;

typedef struct
{
	uint16_t num:9; 			//	номер данных для чтения/записи
	PV_flag_t flagPV:1; 	// флаг ошибки загрузки шагов каретки 
	SP_flag_t flagSP:1;		// флаг ошибки загрузки  времени
	time_flag_t flagTime:1;// флаг ошибки загрузки данных времени
	uint8_t :4;						// резерв
	alarm_flag_t flag_alm;	// флаг активного таймера
	int32_t step;	// текущий сохраненный флаг
	int16_t dist; // установка длины
	int8_t hour;	//кол-во часов
	int8_t min;	// кол-во
	uint16_t v1;	// максимальная скорость каретки
	uint16_t a1;	// время ускорения 
	uint16_t v2;	// максимальная скорость задвижки
	uint16_t v3;	// максимальное скорость источника
}saveData_t;	
saveData_t save;


// обработчик сигнала мигания
void handler_timerUpdateDisplay(void)
{
	timerUpdateDisplay=~timerUpdateDisplay;
	/*
	switch(	timerUpdateDisplay)
	{
		case 1:
		case 3:
			timerUpdateDisplay++;
			timerUpdateDisplay=timerUpdateDisplay%4;
			break;
	}
	*/
}

//========================================
// Состояние таймера для сохранения и запуска
// При работе каретки
sliderTimerState_t sliderTimer;


uint16_t timer1,adc2;
//int16_t a,b;


softTimer_t softTimer, 
						softTimerLed, 
						softTimerBtn,
						softTimerDisp,
						softTimerBlinkError,
						softTimerSave,
						softTimerBlinkSP // мигание символом на экране
						;

ControlSrc_t SrcMoveCntr;

flagModeKalib_t flagKalib;




uint16_t nmb=0,adc0;
uint32_t clks;
//-----



FlagStatus adcStatus;

//Tim2_InitSet_t tim2_Set;

