acc1408/stm8s_osa/main.c
int32_t k;

//butKaret_t butKaret;

// флаг для опроса 
uint8_t flagPollingTimeBtn=0;
int8_t minute=0, 
hour=0, 
flagFastMinutePlus, // флаг быстрая перемотка минут
flagFastMinuteMinus,
flagFastHourPlus,		// флаг быстрая перемотка часов
flagFastHourMinus
;


uint8_t flagLed=0; // флаг мигания
//char st2[]="54:21";


//ds3231_reg_t

void DS3231_timeInNumber(	uint8_t *number, 
													uint8_t *time)
{
	uint8_t i;
	for(i=0;i<3;i++)
	{
		number[i]=(time[i]>>4)*10+time[i]&0x0F;
	}
}

void DS3231_numberInTime(	uint8_t *time,
													uint8_t *number 
													)
{
	uint8_t i;
	for(i=0;i<3;i++)
	{
		time[i]=(number[i]/10)<<4+number[i]%10;
	}
}

uint32_t DS3231_getSecond(	uint8_t *time)
{
	uint32_t s=0;
	uint8_t i;
	const uint16_t k[]={1,60,3600};
	for(i=0;i<3;i++)
	{
		s=s+ ( (time[i]>>4)*10+ time[i] &0x0F )*k[i];
	}
	if (time[3]==0)
	{
		time[3]=1;
	}
	s=s+(uint32_t)(time[3]-1)*86400;
	return s;
}

uint32_t hourMinute_getSecond(	uint8_t hour, uint8_t minute )
{
	uint32_t s=0;
	
	return hour*3600+minute*60;
}

void TIM1_TimeBaseInit_Middle(TIM_Prescaler_TypeDef TIM_Prescaler, uint16_t TIM_Period)
{
	
	const uint16_t TIM1_Prescaler_tab[]={0,1,3,7,15,31,63,127,255,511,1023,2047,4095,8191,16383,32767,65535  }; 
	TIM1_TimeBaseInit(TIM1_Prescaler_tab[TIM_Prescaler], 
                       TIM1_COUNTERMODE_UP,
                       TIM_Period, 
											 0);
}


void clockStep(void)
{
	//pidW.stepPV++;
	PID_stepGpio(&pidCar );
	
	TIM2_ClearITPendingBit(TIM2_IT_UPDATE);
}

void clockStepSlider(void)
{
	//pidW.stepPV++;
	PID_stepGpio(&pidSlider );
	
	TIM3_ClearITPendingBit(TIM3_IT_UPDATE);
}

void clockStepSrc(void)
{
	//pidW.stepPV++;
	PID_stepGpio(&pidSrc );
	
	TIM1_ClearITPendingBit(TIM1_IT_UPDATE);
}

// обработчик программных таймеров
void clockBlinkLed(void)
{
	SoftTimer_ClockISR(&softTimerBlinkError);
	SoftTimer_ClockISR(&softTimerSave);
	SoftTimer_ClockISR(&softTimerDisp);
	SoftTimer_ClockISR(&softTimerUpdate);
	SoftTimer_ClockISR(&softTimerLed);
	SoftTimer_ClockISR(&softTimerBtn);
	SoftTimer_ClockISR(&softTimerBlinkSP);
	
	TIM4_ClearITPendingBit(TIM4_IT_UPDATE);
}

/*
void PID_initPV(pidW_t *pidW, int32_t PV)
{
	pidW->PV=PV;
}
*/
/*
void endKaretKalibPV(void)
{
	int32_t PV=1000;
	//disableInterrupts();
//	PID_initPV(&pidW, PV);
//	PID_stop(&pidW);
	//EXTI_SetExtIntSensitivity(  EXTI_PORT_GPIOA, EXTI_SENSITIVITY_FALL_ONLY);
	//GPIO_Init(endKaretKalib, GPIO_MODE_IN_PU_NO_IT);
	//GPIO_Init(endKaretKalib, GPIO_MODE_IN_PU_IT);
	//enableInterrupts();
	
	
}
*/

uint8_t updateDispaly=0;
void Handler_display(void)
{
	updateDispaly=~updateDispaly;
}



void Handler_time_btn(void)
{
	nop();
	flagPollingTimeBtn=1;
	flagDistCarSP=1;
	alarm.cntBtnOffFlag=1;
}

// 
uint8_t flagSaveData=0;
void Handler_SaveData(void)
{
	flagSaveData=0xFF;
}

uint8_t blinkError=0;
void Handler_displayError(void)
{
	blinkError=~blinkError;
}

uint8_t blinkSeg=0; // флаг мигания
void handler_timerBlinkSeg(void)
{
	blinkSeg=~blinkSeg;
}



void blinkLed(void)
{
	flagLed=~flagLed;
}

void DS3231_timeInNamber()
{
	
}

void LedPolling(void)
{
	// индикация сигнала от каретки
		// Концевик максимум 
		if ( !GPIO_ReadInputPin( CarFarLimit))
		{
			GPIO_WriteHigh(CarFarLimitLed);
			
		}
		else
		{
			GPIO_WriteLow(CarFarLimitLed);
		}
		
		if ( !GPIO_ReadInputPin(CarNearLimit))
		{
			GPIO_WriteHigh(CarNearLimitLed);
			
		}
		else
		{
			GPIO_WriteLow(CarNearLimitLed);
		}
		// Зона заслонки
		if ( !GPIO_ReadInputPin(CarCalibLimit))
		{
			GPIO_WriteHigh(CarCalibLimitLed);
		}
		else
		{
			GPIO_WriteLow(CarCalibLimitLed);
		}
		// --------------------------------
		
		//====================================
		// Опрос концевиков
		if ( !GPIO_ReadInputPin( SliderOpenLimit))
		{
			GPIO_WriteHigh(SliderOpenLimitLed);
		}
		else
		{
			GPIO_WriteLow(SliderOpenLimitLed);
		}
		
		if ( !GPIO_ReadInputPin(SliderCloseLimit))
		{
			GPIO_WriteHigh(SliderCloseLimitLed);
		}
		else
		{
			GPIO_WriteLow(SliderCloseLimitLed);
		}
		
		//==============================
		// Алгоритм работы Источника
		//------------------------------
		// индикация сигнала от светодиода
		if ( !GPIO_ReadInputPin( SrcUpLimit))
		{
			GPIO_WriteHigh(SrcUpLimitLed);
		}
		else
		{
			GPIO_WriteLow(SrcUpLimitLed);
		}
		
		if ( !GPIO_ReadInputPin(SrcDownLimit))
		{
			GPIO_WriteHigh(SrcDownLimitLed);
		}
		else
		{
			GPIO_WriteLow(SrcDownLimitLed);
		}
		
		
		//==================================
		//  мигание светодиодами в зависимости 
		// 	от того какая ось работает
		//-----------------------------
		// Мигание при работе оси каретки
		if (PID_getStatePower(&pidCar) != power_off	)
		{
			if (PID_getStateDir(&pidCar) == stepUp	)
			{
				if ( flagLed )
				{
					GPIO_WriteHigh(CarFarBtnLed);
				}
				else
				{
					GPIO_WriteLow(CarFarBtnLed);
				}
			}
			else
			{
				if ( flagLed )
				{
					GPIO_WriteHigh(CarNearBtnLed);
				}
				else
				{
					GPIO_WriteLow(CarNearBtnLed);
				}
			}
		}
		else
		{
			GPIO_WriteLow(CarFarBtnLed);
			GPIO_WriteLow(CarNearBtnLed);
		}
		// Мигание при работе оси затвора	
		if (PID_getStatePower(&pidSlider) != power_off)
		{
			if (PID_getStateDir(&pidSlider) == stepUp	)
			{
				if ( flagLed )
				{
					GPIO_WriteHigh(SliderOpenBtnLed);
				}
				else
				{
					GPIO_WriteLow(SliderOpenBtnLed);
				}
			}
			else
			{
				if ( flagLed )
				{
					GPIO_WriteHigh(SliderCloseBtnLed);
				}
				else
				{
					GPIO_WriteLow(SliderCloseBtnLed);
				}
			}
		}
		else
		{
			GPIO_WriteLow(SliderOpenBtnLed);
			GPIO_WriteLow(SliderCloseBtnLed);
		}
		//----------------------------
		
		
		
		//----------------------------
		// Мигание при работе оси источника		
		if (PID_getStatePower(&pidSrc) != power_off)
		{
			if (PID_getStateDir(&pidSrc) == stepUp	)
			{
				if ( flagLed )
				{
					GPIO_WriteHigh(SrcUpBtnLed);
				}
				else
				{
					GPIO_WriteLow(SrcUpBtnLed);
				}
			}
			else
			{
				if ( flagLed )
				{
					GPIO_WriteHigh(SrcDownBtnLed);
				}
				else
				{
					GPIO_WriteLow(SrcDownBtnLed);
				}
			}
		}
		else
		{
			GPIO_WriteLow(SrcUpBtnLed);
			GPIO_WriteLow(SrcDownBtnLed);
		}
		//--------------------------------
		// Проверка различных режимов работы
		if (	stateCarSlider==state_SliderOpen_OutZone
				//||stateCarSlider==state_SliderOpen_OutZone_SrcDownDist
				)
		{
			GPIO_WriteHigh(SliderOpenBtnLed);
		}
		//-------------------------
		
		if (	stateCarSlider==state_SliderClose_OutZone)
		{
			GPIO_WriteHigh(SliderCloseBtnLed);
		}
		//---------------------------------------
		if (	stateCarSlider == stateCarCalib)
		{
			GPIO_WriteHigh(CarCalibBtnLed);
		}
		else
		{
			GPIO_WriteLow(CarCalibBtnLed);
		}
		//-----------------------------
		// 
		if (	stateCarSlider == state_CarAutoStart)
		{
			GPIO_WriteHigh(CarAutoStartBtnLed);
		}
		else
		{
			GPIO_WriteLow(CarAutoStartBtnLed);
		}
		
