acc1408/stm8s_osa/main.c
		//--------------------------------------
		// индикация включения режима таймера
		if (	 state_AlarmStart <= stateCarSlider 
				&& stateCarSlider<=state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone_CarAuto
				|| alarm.flag_alm== alarmOn )
		{
			GPIO_WriteHigh(SliderTimeStartBtnLed);
		}
		else
		{
			GPIO_WriteLow(SliderTimeStartBtnLed);
		}
		
}

void StepMotorCar_Init(int32_t PV)
{
	// настройка оси каретки
	TIM2_ARRPreloadConfig(ENABLE);
	TIM2_ITConfig(TIM2_IT_UPDATE, ENABLE);
	
	PID_Init_Gpio(	&pidCar,
									TIM2_TimeBaseInit,
									TIM2_Cmd,
									
									clkStep1,
									dirStep1,
									enStep1,
									//CarCalibLimit,
									
									
									limitSW_Level_Low,
									CarFarLimit,
									
									limitSW_Level_Low,
									CarNearLimit	);
	//save.step
	PID_initTab(&pidCar,
							PV, // текущее значение PV
							16000000, // частота
							microStep1, // микрошагов
							20, // Шаг дифференцирования ms 
							save.a1, // время раскрутки
							200, // время торможения
							save.v1, // скорость вращения
							3, // кол-во последних уровней для добавления шагов
							10 // кол-во шагов перед остановкой
							);
}




void StepMotorSlider_Init(void)
{
	// Затвор
	TIM3_ARRPreloadConfig(ENABLE);
	TIM3_ITConfig(TIM3_IT_UPDATE, ENABLE);
	
	PID_Init_Gpio(	&pidSlider,
									TIM3_TimeBaseInit,
									TIM3_Cmd,
									
									clkStep2,
									dirStep2,
									enStep2,
									
									limitSW_Level_Low,
									SliderOpenLimit,
									
									limitSW_Level_Low,
									SliderCloseLimit	);
	
	PID_initTab(&pidSlider,
							0, // текущее значение PV
							16000000, // частота
							SliderMicroStep, // микрошагов
							20, // Шаг дифференцирования ms 
							SliderTimeAccel, // время раскрутки
							SliderTimeBreak, // время торможения
							save.v2, // скорость вращения
							3, // кол-во последних уровней для добавления шагов
							10 // кол-во шагов перед остановкой
							);
}

void StepMotorSrc_Init(void)
{
	
	//----------------------------------------
	
	//----------------------------------------
	TIM1_ARRPreloadConfig(ENABLE);
	TIM1_ITConfig(TIM1_IT_UPDATE, ENABLE);
	TIM1_TimeBaseInit(0, 
                       TIM1_COUNTERMODE_UP,
                       0xFFFF,
											 0);
											 
	
	
	PID_Init_Gpio(	&pidSrc,
									TIM1_TimeBaseInit_Middle,
									TIM1_Cmd,
									
									clkStepSrc_3,
									dirStepSrc_3,
									enStepSrc_3,
									
									limitSW_Level_Low,
									SrcUpLimit,
									
									limitSW_Level_Low,
									SrcDownLimit	);
	
	PID_initTab(&pidSrc,
							0, // текущее значение PV
							16000000, // частота
							SrcMicroStep, // микрошагов
							20, // Шаг дифференцирования ms 
							1500, // время раскрутки
							300, // время торможения
							save.v3, // скорость вращения
							3, // кол-во последних уровней для добавления шагов
							10 // кол-во шагов перед остановкой
							);
	// настройка зоны заслонки/ точки калибровки
}


void DownloadSetting( void)
{
	uint16_t i,j;
		//  Поиск данных для загрузки из памяти
	
	
	for (i=0;i<512;i++)
	{
		//save.num=i;
		j=0;
		while(
		I2Csw_readFromMemoryByte2( &I2Csw_Gpio,
																AT24C32_devAdr,
																i*8,
																(uint8_t*)&save.step,
																8)!=I2Csw_success && j++ <maxRepeatWrite );
																
		if (save.step>=0)
		{
			// координата существует и найдена
			if (save.dist<0)
			{
					save.dist=1000;
			}
			
			if (save.hour<0 || save.min<0)
			{
				save.hour=1;
				save.min=0; // будильник отключен
			}
			goto next_record;
			break;
		}
	}
	//если все блок просмотрен
	// но истинной координаты не найдено, 
	save.step=100000;
	save.dist=1000;
	save.hour=1;
	save.min=0; // будильник отключен
	// то включаем мигание ошибки
	SoftTimer_CMD(&softTimerBlinkError,ENABLE);
	//save.dist=1000;
	next_record:
	// запись данных в новую ячейку памяти
	save.num++;
	j=0;
	while(I2Csw_sendToMemoryByte2( &I2Csw_Gpio,
																	AT24C32_devAdr,
																	save.num*8,
																	(uint8_t*)&save.step,
																	8)!=I2Csw_success && j++ <maxRepeatWrite );
																	
	// очистка данных
	
	// стираем прошлые данные
	temp_16u=0xFFFF;
	//temp_32u=0xFFFFFFFFF;
	for (i=0;i<4;i++)
	{
		j=0;
		while(
		I2Csw_sendToMemoryByte2(&I2Csw_Gpio,
															AT24C32_devAdr,
															(save.num-1)*8+i*2,
															(uint8_t*)&temp_16u,
															2) !=I2Csw_success && j++ <maxRepeatWrite );
	}
	
	// извлекаем из минут сигнал будильника
	// 6 бит является сингналом будильника
	// 5-0 биты - значение минут
	if (save.min&maskTimeFlagAlm)
	{
		save.flag_alm=alarmOn;
		save.min&=maskTimeMin;
	}
	else
	{
		save.flag_alm=alarmOff;
	}
	//------------------
	//	
	// конец блока чтения данных из EEPROM
}

void GPIO_All_Init(void)
{
	GPIO_Init(CarCalibLimit, GPIO_MODE_IN_PU_IT);
	// Ошибка по превышению тока
	GPIO_Init(AlmStep, GPIO_MODE_IN_PU_NO_IT);
	// кнопки управления кареткой
	GPIO_Init(CarFarBtn, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(CarNearBtn, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(CarAutoStartBtn, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(CarCalibBtn, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(CarAutoDistPlusBtn, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(CarAutoDistMinusBtn, GPIO_MODE_IN_PU_NO_IT);
	// светодиоды кнопок управления кареткой 
	// GPIO_MODE_OUT_PP_LOW_FAST
	GPIO_Init(CarFarBtnLed, 			GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(CarNearBtnLed, 			GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(CarAutoStartBtnLed, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(CarCalibBtnLed, 		GPIO_MODE_OUT_PP_LOW_FAST);
	// Светодиоды индикаторов каретки
	GPIO_Init(CarFarLimitLed, 		GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(CarNearLimitLed, 		GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(CarCalibLimitLed, 	GPIO_MODE_OUT_PP_LOW_FAST);
	//-------------------------------------------
	// кнопки управления затвором
	GPIO_Init(SliderHourPlusBtn, 		GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SliderHourMinusBtn, 	GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SliderMinutePlusBtn, 	GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SliderMinuteMinusBtn, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SliderTimeStartBtn, 	GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SliderOpenBtn, 				GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SliderCloseBtn, 			GPIO_MODE_IN_PU_NO_IT);
	// светодиоды кнопок управления затвором
	// Светодиоды
// Встроенный светодиоды Кнопки
	GPIO_Init(SliderOpenBtnLed, 		GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(SliderCloseBtnLed, 		GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(SliderTimeStartBtnLed,GPIO_MODE_OUT_PP_LOW_FAST);
	// светодиоды индикации управления затвором
	
