acc1408/stm8s_osa/main.c
	GPIO_Init(SliderOpenLimitLed, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(SliderCloseLimitLed, GPIO_MODE_OUT_PP_LOW_FAST);
	
	//------------------------------------------------
	//====================================================
	
	
	// кнопки управления источником
	GPIO_Init(SrcUpBtn, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SrcDownBtn, GPIO_MODE_IN_PU_NO_IT);
	// светодиоды кнопок управления источником
	GPIO_Init(SrcUpBtnLed, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(SrcDownBtnLed, GPIO_MODE_OUT_PP_LOW_FAST);
	// светодиоды индикации управления источником
	GPIO_Init(SrcUpLimitLed, GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(SrcDownLimitLed, GPIO_MODE_OUT_PP_LOW_FAST);
	//======================================
	// кнопка сброс
	GPIO_Init(ResetBtn, GPIO_MODE_IN_PU_NO_IT);
	// светодиод кнопки сброс
	GPIO_Init(ResetBtnLed, GPIO_MODE_OUT_PP_LOW_FAST);
	//----------------
	// Кнопка Вкл/выкл
	GPIO_Init(OnOffBtn, GPIO_MODE_IN_PU_NO_IT);
	
	// Кнопка стоп
	GPIO_Init(StopBtn, GPIO_MODE_IN_PU_NO_IT);
	
	GPIO_Init(StopL, GPIO_MODE_OUT_PP_LOW_FAST);
	
	//--------------
	// концевик двери
	GPIO_Init(SwDoorLimit, GPIO_MODE_IN_PU_NO_IT);
	GPIO_Init(SwDoorCoil, GPIO_MODE_OUT_PP_LOW_FAST);
	
}


void SoftTimerAll_Init(void)
{
	//-----------------------------------------
	// инициализация таймера светодиода
	//---------------------------
	SoftTimer_Init(&softTimer,// указатель на работу таймера
							1,			// значение автообновления
							0		// обработчик переполнения	
							);
	SoftTimer_CMD(&softTimer,ENABLE);
	
	
	//-----------------------------------
	
	SoftTimer_Init(&softTimerLed,// указатель на работу таймера
							125,			// значение автообновления
							blinkLed		// обработчик переполнения
							);
	SoftTimer_CMD(&softTimerLed,ENABLE);
	
	//-------------------------
	
	SoftTimer_Init(&softTimerBtn,// указатель на работу таймера
							250,			// значение автообновления
							Handler_time_btn		// обработчик переполнения
							);
	SoftTimer_CMD(&softTimerBtn,ENABLE);
	
	//-------------------------
	// таймер обновления экранчиков
	SoftTimer_Init(&softTimerDisp,// указатель на работу таймера
							20,			// значение автообновления
							Handler_display		// обработчик переполнения
							);
	SoftTimer_CMD(&softTimerDisp,ENABLE);
	
	// таймер для мигания ошибки каретки
	SoftTimer_Init(&softTimerBlinkError,// указатель на работу таймера
							500,			// значение автообновления
							Handler_displayError		// обработчик переполнения
							);
	//SoftTimer_CMD(&softTimerBlinkError,ENABLE);
	
	SoftTimer_Init(&softTimerSave,// указатель на работу таймера
							3000,			// значение автообновления
							Handler_SaveData		// обработчик переполнения
							);
	SoftTimer_CMD(&softTimerSave,ENABLE);
	
	// таймер для мигания двоеточием у часов
	SoftTimer_Init(&softTimerUpdate,// указатель на работу таймера
							500,			// значение автообновления
							handler_timerUpdateDisplay	// обработчик переполнения
							);
	/*
	SoftTimer_CMD(&softTimerUpdate,
									ENABLE);
	*/						
	// таймер для мигания символом для SP
	SoftTimer_Init(&softTimerBlinkSP,// указатель на работу таймера
							250,			// значение автообновления
							handler_timerBlinkSeg	// обработчик переполнения
							);						
	SoftTimer_CMD(&softTimerBlinkSP,
									ENABLE);
	
}

#ifdef  __OSA__
void Task_2(void)
{

	while(1)
	{
		
	OS_Delay(20);
	}
}




void Task(void)
{
	uint8_t i,temp;
	
	
	while(1)
	{
		
		OS_Delay(500);
	}
}
#endif

uint16_t k2,i;

uint8_t f;
//int32_t PV; // данные для считывания
I2Csw_result_t rt_i2c;
volatile uint16_t delay16, d16;

void main(void)
{
 #ifdef  __OSA__
 // Увеличиваем частоты тактирования до 16МГц
	CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
 	OS_Init();  // Инициализация RTOS OSA
	TIM4_TimerOSA(1000); //Настраиваем прерывание 500мкс
//	OS_Task_Create(7, Task); // создаем задачу
	OS_Task_Create(7, Task_2); // создаем задачу
	OS_EI();   // Разрешить все прерывания
	OS_Run(); // Запуск ядра RTOS OSA
#else
	/* Infinite loop */
//	cf_u=&cf;
	// Первоначальная инициализация драйверов
	GPIO_Init(enStepSrc_3,GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(enStep1, 		GPIO_MODE_OUT_PP_LOW_FAST);
	GPIO_Init(enStep2, 		GPIO_MODE_OUT_PP_LOW_FAST);
	 
	 
	//Init_Delay();
	temp_32=0x4FFF;
	while(temp_32--);
	CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
	//-----------------------
	// Инициализация АЦП
	ADC2_SingleOne_Init(	ADC2_PRESSEL_FCPU_D10, 
													ADC2_Handler_NoIT);
	
	
		// чтение данных скорости каретки
	ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_12);
	save.v1= (ADC2_SingleOne_GetConversion()>>3)*8+CarMinV1;
	
	// время ускорения каретки
	ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_11);
	save.a1= (ADC2_SingleOne_GetConversion()>>3)*24+1;
	
	// максимальная скорость задвижки
	ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_10);
	save.v2= (ADC2_SingleOne_GetConversion()>>3)*8+1;
	
	// максимальная скорость источника
	ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_7);
	save.v3= (ADC2_SingleOne_GetConversion()>>3)*8+1;
													
	
	/// Настройка I2C
	//I2C_Init_7bit(100000);
	f=I2Csoft_INIT(&I2Csw_Gpio,
											GPIO_SDA,
											GPIO_SCL,
											16,	// 16 МГц
											100, // 80 кГц
											100	// таймоут 100 мс
											);
	// Запуск таймер на всякий случай
	I2Csw_sendToMemoryByte1( &I2Csw_Gpio,
													DS3231_devAdr, // адрес часов
													DS3231_control, //адрес 
													&DS3231_regCntr, //значение регистра
													1);
	//--------------------
	// установка флагов ошибок
	//save.flagPV=PV_error;
	//save.flagSP=SP_error;
	//save.flagTime=time_error;
	//------------------------------
	// Загрузка данных из EEPROM 
	DownloadSetting();
	

	//------------------------------------------
	//-----------------------------------------
	// ----------------------------------------
	// инициализация экрана
	TM1637_Init(&disp1, 	tm1637_1,tm1637_bright_3); // SP
	TM1637_Init(&disp2, 	tm1637_2,tm1637_bright_2); // PV
	TM1637_Init(&dispTimer,tm1637_3,tm1637_bright_2);
	TM1637_Init(&dispTimerAlarm, 	tm1637_4,tm1637_bright_3);
	//-----------------------------------
	// Инициализация всех программых таймеров
	SoftTimerAll_Init();
	
	
	
	//----------------
	// настройка таймера
	// 1 мс
	TIM4_TimeBaseInit(TIM4_PRESCALER_128, 124);
	TIM4_ITConfig(TIM4_IT_UPDATE, ENABLE);
	TIM4_Cmd(ENABLE);
	//----------------------------------
	// Инициализация и расчет двигателей
	StepMotorCar_Init(save.step);
	StepMotorSlider_Init();
	StepMotorSrc_Init();
	// инициализация всех пинов
	GPIO_All_Init();
	
	
	
	
	
	// Инциализация источника
	SrcMoveCntr=SrcMoveIdle;
	//	ButtonInit(&Handler_SrcUpBtn,100, SrcUpBtn);
	
	//ButtonInit(&Handler_SrcDownBtn,100, SrcDownBtn);
	
	//-------------------------------------------------
	//=====================================================
	// Кнопки модуля каретки
	// кнопки 
	//==================================================
	//ButtonInit(&Handler_CarAutoDistPlusBtn,100, CarAutoDistPlusBtn);
	//ButtonInit(&Handler_CarAutoDistMinusBtn,100, CarAutoDistMinusBtn);
	//============================================
	// настройка состояния таймера для 
	sliderTimer=sliderTimerInit;
	// загрузка данных настройки таймера из памяти
	/*
	if(save.min&maskTimeFlagAlm)
	{
		alarm.flag_alm=alarmOn;
	}
	else
	{
		alarm.flag_alm=alarmOff;
	}
	*/
	alarm.min_alm= save.min&maskTimeMin;
	alarm.hour_alm=save.hour;
	alarm.flag_alm=save.flag_alm;
	alarm.s_alm= (uint32_t)alarm.hour_alm*3600+(uint32_t)alarm.min_alm*60;
	
