acc1408/stm8s_osa/main.c
	// загрузка данных в счетчик расстояния
	distCarSP=save.dist;
	
	enableInterrupts();
	
	
	
	while (1)
  {
		//===========================================
		// Оповещение режимов работы
		//---------------------------------------
		LedPolling();
		//-----------------
		// режим закрытия
		
		
		//------------------------------
		// индикация будильника
		//====================================
		// модуль управления экранами
		// каретки
		// модуль дисплея обновляется 50Гц
		if (updateDispaly)
		{
			updateDispaly=0;
			
			//blinkSeg 
			//incDistCarSP
		
			
			sprintf(st,"%4d", distCarSP);
				if (incDistCarSP>100)
			{
				if (blinkSeg)
				{
					st[1]=' ';
				}
			}
			else
			if (incDistCarSP>10)
			{
				if (blinkSeg)
				{
					st[2]=' ';
				}
			}
			TM1637_4digit_TextOutput(&disp1,st);
			
			
			if (blinkError)
			{
				// если ошибка есть
				sprintf(st,"ErrL" );	
			}
			else
			{
				distCarPV=PID_getPV(&pidCar)/ (int16_t)ConvStepIntoDist;
				sprintf(st,"%4d", distCarPV);
			}
			TM1637_4digit_TextOutput(&disp2,st);
			// если таймер работает значит необходимо мигать
			if( SoftTimer_getState (&softTimerUpdate) )
			{
				if(timerUpdateDisplay)
				{
					sprintf(st,"%d%d:%d%d",DS3231_reg[2]>>4,DS3231_reg[2]&0x0F,DS3231_reg[1]>>4,DS3231_reg[1]&0x0F);
				}
				else
				{
					sprintf(st,"%d%d%d%d",DS3231_reg[2]>>4,DS3231_reg[2]&0x0F,DS3231_reg[1]>>4,DS3231_reg[1]&0x0F);
				}
			}
			else
			{
				sprintf(st,"%d%d:%d%d",DS3231_reg[2]>>4,DS3231_reg[2]&0x0F,DS3231_reg[1]>>4,DS3231_reg[1]&0x0F);
			}
			TM1637_4digit_TextOutput(&dispTimer,st);
		
		}
		
		
		
		//--------------------------------------
		//  Считывание данных из DS3231
		//  и обновление экрана для мигания
		//--------------------------------------
		/*
		switch(timerUpdateDisplay)
		{
			case 0:
				sprintf(st,"%d%d:%d%d",DS3231_reg[1]>>4,DS3231_reg[1]&0x0F,DS3231_reg[0]>>4,DS3231_reg[0]&0x0F);
				goto lbl_printTimer;
				break;
			case 2:
				sprintf(st,"%d%d%d%d",DS3231_reg[1]>>4,DS3231_reg[1]&0x0F,DS3231_reg[0]>>4,DS3231_reg[0]&0x0F);
				lbl_printTimer:
				TM1637_4digit_TextOutput(&dispTimer,st);
				timerUpdateDisplay++;
				break;
		}
		*/
		
		
		
		
		//------------------------------------
		// Проверку на необходимость сохранять данные
		// происходит каждые 3 секунды
		if (flagSaveData)
		{
			flagSaveData=0;
			// Проверка на необходимость сохранения данных
			// часов
			if (alarm.hour_alm != save.hour || 
					alarm.min_alm != save.min ||  
					alarm.flag_alm != save.flag_alm  )
			{
				save.hour=alarm.hour_alm;
				//save.min=alarm.flag_alm|alarm.min_alm;
				if (alarm.flag_alm)
				{
					save.min=alarm.min_alm|maskTimeFlagAlm;
					save.flag_alm=alarmOn;
				}
				else
				{
					save.min=alarm.min_alm;
					save.flag_alm=alarmOff;
				}
				j=0;
				while(
				I2Csw_sendToMemoryByte2(&I2Csw_Gpio,
																	AT24C32_devAdr,
																	save.num*8+6,
																	(uint8_t*)&save.hour,
																	2) !=I2Csw_success && j++ <maxRepeatWrite );
				save.min=alarm.min_alm;
			}
			//--------------
			// Проверка на необходимость сохранения данных дистанации
			if (distCarSP !=save.dist)
			{
				save.dist=distCarSP;
				j=0;
				while(
				I2Csw_sendToMemoryByte2(&I2Csw_Gpio,
																	AT24C32_devAdr,
																	save.num*8+4,
																	(uint8_t*)&save.dist,
																	2) !=I2Csw_success && j++ <maxRepeatWrite );
			}
			//--------------------
			// Проверка на необходимость перерасчета скорости
			if (stateCarSlider == stateCarSliderIdle) 
			{
				//----------------------------------
				// Проверка настройки для первой оси
				//максимальная скорость каретки
				ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_12);
				temp_16u= (ADC2_SingleOne_GetConversion()>>3)*8+1;
				
				// время ускорения каретки
				ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_11);
				temp2_16u= (ADC2_SingleOne_GetConversion()>>3)*24+1;
				
				
				if (save.v1 !=temp_16u  || save.a1!= temp2_16u)
				{
					save.v1 =temp_16u ;
					save.a1= temp2_16u;
						StepMotorCar_Init(  PID_getPV(&pidCar)    );
				}
				//---------------------------------
				//Проверка настройки для 2 оси
				// максимальная скорость задвижки
				ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_10);
				temp_16u = (ADC2_SingleOne_GetConversion()>>3)*8+1;
				if (save.v2 !=temp_16u  )
				{
					save.v2 =temp_16u ;
					StepMotorSlider_Init();
				}
				//----------------------------------
				// Проверка настройки для 3 оси
				// максимальная скорость источника
				ADC2_SingleAny_Start(ADC2_SOFT,ADC2_CHANNEL_7);
				temp_16u = (ADC2_SingleOne_GetConversion()>>3)*8+1;
				// Все оси не вращаются
				if (save.v3 !=temp_16u )
				{
					save.v3 =temp_16u ;
					StepMotorSrc_Init();
				}
			}
			
		}
		
		//------------------------------------
		// Модуль управления кареткой 
		
		// если затвор закрыт и достигли зоны затвора, то останавливаемся
		//if ( GPIO_ReadInputPin(SliderOpenLimit) && !GPIO_ReadInputPin(CarCalibLimit))
		//{
		//	PID_stop_auto(&pidCar);
			//PID_stop_man_dir(&pidCar, stepDown);
		//}
		//--------------------------------
		// модуль управления кареткой и затвором
		
		switch(stateCarSlider)
		{
			case stateCarSliderIdle:
				// обработчик кнопок
				if ( GPIO_ReadInputPin( OnOffBtn))
				{
						// ручное перемещение каретки назад
						if (!GPIO_ReadInputPin(CarNearBtn))
						{
							stateCarSlider=stateCarManNear;	
							goto lbl_stateCarManNear;					
						}
						
						// ручное перемещение каретки вперед
						if (!GPIO_ReadInputPin(CarFarBtn))
						{
							stateCarSlider=stateCarManFar;	
							goto lbl_stateCarManFar;					
						}
						
						// калибровка
						if (!GPIO_ReadInputPin(CarCalibBtn ))
						{
							if ( GPIO_ReadInputPin( CarCalibLimit) )
							{
								PID_calibInit( &pidCar,
																CarCalibLimit,
																limitSW_Level_Low,		
																(int32_t)CalibLimitIn_mm* (int32_t)ConvStepIntoDist
																);
								PID_start_man(&pidCar, stepDown);
								
