acc1408/stm8s_osa/main.c
							}
							else
							{
								PID_calibInit( &pidCar,
																CarCalibLimit,
																limitSW_Level_High,		
																(int32_t)CalibLimitIn_mm* (int32_t)ConvStepIntoDist
																);
								PID_start_man(&pidCar, stepUp);	
							}
							// Отключаем таймер
							SoftTimer_CMD(&softTimerBlinkError,DISABLE);
							blinkError=0; // отключаем мигание
							stateCarSlider=stateCarCalib;	
							goto lbl_stateCarCalib;	
						}
						//----------------------------------
						// Кнопка запуск задания
						if (!GPIO_ReadInputPin(CarAutoStartBtn ))
						{
							stateCarSlider=state_CarAutoStart;
							goto lbl_state_CarAutoStart;
						}
						//-----------------
						// открыть створку
						if ( !GPIO_ReadInputPin(SliderOpenBtn) && 
									GPIO_ReadInputPin(SliderOpenLimit) &&
									GPIO_ReadInputPin(SwDoorLimit) 
									)
						{
							//stateCarSlider=state_SliderOpen_OutZone_SrcDownDist;
							stateCarSlider=state_SliderOpen_OutZone;
							goto lbl_state_SliderOpen_OutZone;
						
						}
						//----------------------------------------------------
						// закрыть створку
						if ( !GPIO_ReadInputPin(SliderCloseBtn) && 
									GPIO_ReadInputPin(SliderCloseLimit) )
						{
							stateCarSlider=state_SliderClose_OutZone;
							goto lbl_state_SliderClose_OutZone;
						}
						
						// поднять источник
						if ( !GPIO_ReadInputPin(SrcUpBtn) && 
									GPIO_ReadInputPin(SrcUpLimit))
						{
							stateCarSlider=state_SrcUp;
							goto lbl_state_SrcUp;
						}
						//----------------------------------------------------
						// опустить источник
						if ( !GPIO_ReadInputPin(SrcDownBtn) 
								&& GPIO_ReadInputPin(SrcDownLimit) 	)
						{
							stateCarSlider=state_SrcDown;
							goto lbl_state_SrcDown;
						}
						//-------------------------------------------
						// запуск будильника
						if ( !GPIO_ReadInputPin(SliderTimeStartBtn) 
								&& alarm.cntBtnOff>=alarm_btn_time_off )
						{
							alarm.cntBtnOff=0;
							if (	alarm.flag_alm == alarmOff)
							{
								
								// алгоритм включения будильника
								if ( GPIO_ReadInputPin(SliderOpenLimit))
								{
									// если створка закрыта
									stateCarSlider =state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone_CarAuto;
									goto        lbl_state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone_CarAuto;
								}
								else
								{
									stateCarSlider =state_AlarmStart_SrcUp_CarAuto;
									goto        lbl_state_AlarmStart_SrcUp_CarAuto;
								}
							}
							else
							{
								// алгоритм выключения будильника
								alarm.flag_alm = alarmOff;
							}
						}
						else
						{
							// сброс счетчика нажатий
							if (alarm.cntBtnOffFlag)
								{
									alarm.cntBtnOffFlag=0;
									if (alarm.cntBtnOff<=alarm_btn_time_off)
									{
										alarm.cntBtnOff++;
									}
								}
						}
						//-------------------
						// отключаем замок двери
						GPIO_WriteLow(SwDoorCoil);
				}
				else
				{
					// контакты замкнуты
					// идет блокировка кнопок
					GPIO_WriteHigh(SwDoorCoil);
				}
				//-----------------------------------
				if (alarm.flag_alm == alarmOn)
				{
					if (alarm.s_alm<=DS3231_getSecond(	DS3231_reg) ) 
					{
						alarm.flag_alm = alarmOff;
						stateCarSlider =state_SliderClose_OutZone;
						goto        lbl_state_SliderClose_OutZone;
					}
				}
				//-----------------------
				// Открытие двери
				// Приводит к уборке источника
//				SwDoorLimit
				if ( !GPIO_ReadInputPin(SwDoorLimit) && 
							GPIO_ReadInputPin(SliderCloseLimit)  )
				{
					stateCarSlider=state_SliderClose_OutZone;
					goto lbl_state_SliderClose_OutZone;
				}
				
				/*
				if ( !GPIO_ReadInputPin(SwDoorLimit) && 
							!GPIO_ReadInputPin(SrcUpLimit) )
				{
					stateCarSlider=state_SrcDownDist;
					goto lbl_state_SrcDownDist;
				}
				*/
				break;
			//------------------------
			// обработчик команд
			case stateCarManNear:
				//lbl_stateCarManNear:
				if (!GPIO_ReadInputPin(CarNearBtn))
				{
					lbl_stateCarManNear:
					if ( GPIO_ReadInputPin(CarCalibLimit))
					{
						PID_start_man(&pidCar, stepDown);
					}
					else
					if ( !GPIO_ReadInputPin(SliderOpenLimit))
					{
						PID_start_man(&pidCar, stepDown);
					}
					else
					{
						PID_stop(&pidCar);
						goto lbl_testIdle;
					}
				}
				else
				{
					PID_stop(&pidCar);
					goto lbl_testIdle;
				}
				break;
				//--------------------------------
			case stateCarManFar:
				lbl_stateCarManFar:
				if (!GPIO_ReadInputPin(CarFarBtn))
				{
					//lbl_stateCarManFar:
					PID_start_man(&pidCar, stepUp);								
				}
				else
				{
					PID_stop_man_dir(&pidCar, stepUp);
					goto lbl_testIdle;
				}
				break;
				//-----------------
			case stateCarCalib:
				lbl_stateCarCalib:
				if (	!GPIO_ReadInputPin(CarNearBtn)
						|| !GPIO_ReadInputPin(CarFarBtn)	)
				{
					PID_stop(&pidCar);
					stateCarSlider=stateWaitIdle;
				}
				goto lbl_testIdle;
				break;
			//-------------------------
			case state_CarAutoStart:
				lbl_state_CarAutoStart:
				//stateCarSliderIdle
				
		
				if (PID_getStatePower(&pidCar) == power_off	
						&& PID_getStateRot(&pidCar)==rot_stop)
				{
					if( PID_getPV(&pidCar)  == (int32_t)ConvStepIntoDist * (int32_t)distCarSP)
					{
						if(stateCarSlider == state_CarAutoStart)
						{
							stateCarSlider=stateWaitIdle;
							goto lbl_testIdle;
						}
						else
						{
							// переход в следующее состояние
							stateCarSlider--;
						}
						
					}
					else
					if ( !GPIO_ReadInputPin(SliderOpenLimit) || GPIO_ReadInputPin(CarCalibLimit))
					{
						PID_start_auto(&pidCar, 
									(int32_t)ConvStepIntoDist * (int32_t)distCarSP);
						
						if ( 		!GPIO_ReadInputPin(CarFarLimit)&& PID_getStateDir(&pidCar)==stepUp
								|| !GPIO_ReadInputPin(CarNearLimit)&& PID_getStateDir(&pidCar)==stepDown
						)
						{
							PID_stop(&pidCar);
							stateCarSlider=stateWaitIdle;
							goto lbl_testIdle;
						}
									
