acc1408/stm8s_osa/main.c
					}
					else
					{
						if ( PID_getPV(&pidCar) <(int32_t)ConvStepIntoDist * (int32_t)distCarSP)
						{
							PID_start_auto(&pidCar, 
									(int32_t)ConvStepIntoDist * (int32_t)distCarSP);
							if ( 		!GPIO_ReadInputPin(CarFarLimit)&& PID_getStateDir(&pidCar)==stepUp
								|| !GPIO_ReadInputPin(CarNearLimit)&& PID_getStateDir(&pidCar)==stepDown
							)
							{
								PID_stop(&pidCar);
								stateCarSlider=stateWaitIdle;
								goto lbl_testIdle;
							}
						}
						else
						{
							if (stateCarSlider==state_CarAutoStart )
							{
								stateCarSlider=stateWaitIdle;
								goto lbl_testIdle;
							}
							else
							{
								stateCarSlider--;
							}
						}
					}
				}
				else
				if (	!GPIO_ReadInputPin(CarFarBtn)
						||!GPIO_ReadInputPin(CarNearBtn))
				{
					PID_stop(&pidCar);
					stateCarSlider=stateWaitIdle;
					goto lbl_testIdle;
					//PID_start_man(&pidCar, stepUp);								
				}
				else
				if ( 		GPIO_ReadInputPin(SliderOpenLimit) 
						&& !GPIO_ReadInputPin(CarCalibLimit)
						&& PID_getStateDir(&pidCar)== stepDown )
				{
					PID_stop(&pidCar);
					
					if(stateCarSlider == state_CarAutoStart)
					{
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
					else
					{
						// переход в следующее состояние
						stateCarSlider--;
					}
				}
				
				break;
			//----------------------------------------
			
			//------------------------
	
			case state_SliderOpen:
				lbl_state_SliderOpen:
				if (GPIO_ReadInputPin(CarCalibLimit)	)
				{
					// каретка вне зоны заслонки
					if (!GPIO_ReadInputPin(SliderCloseBtn))
					{
						// нажали в другую сторону
						PID_stop(&pidSlider);
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
						//PID_start_man(&pidCar, stepUp);								
					}
					else
					{
						PID_start_man(&pidSlider, stepUp);
						if ( !GPIO_ReadInputPin(SliderOpenLimit))
						{
							// достигли зоны концевика
							PID_stop(&pidSlider);
							if (stateCarSlider==state_SliderOpen)
							{
								PID_stop(&pidSlider);
								stateCarSlider=stateWaitIdle;
								goto lbl_testIdle;
							}
							else
							{
								stateCarSlider--;
							}
						}
					}
				}
				else
				{
					// Каретка в зоне заслонки
					PID_stop(&pidSlider);
					stateCarSlider++;
				}
				
				break;
			
			//----------------------------------	
			
			//------------------------
			case state_SliderClose:
				lbl_state_SliderClose:
				if (GPIO_ReadInputPin(CarCalibLimit)	)
				{
					// каретка вне зоны заслонки
					if (!GPIO_ReadInputPin(SliderOpenBtn))
					{
						// нажали в другую сторону
						PID_stop(&pidSlider);
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
						//PID_start_man(&pidCar, stepUp);								
					}
					else
					{
						PID_start_man(&pidSlider, stepDown);
						if ( !GPIO_ReadInputPin(SliderCloseLimit))
						{
							// достигли зоны концевика
							PID_stop(&pidSlider);
							if (stateCarSlider==state_SliderClose)
							{
								stateCarSlider=stateWaitIdle;
								goto lbl_testIdle;
							}
							else
							{
								stateCarSlider--;
							}
						}
					}
				}
				else
				{
					// Каретка в зоне заслонки
					PID_stop(&pidSlider);
					stateCarSlider++;
				}
				
				break;
			
			
			case state_OutZone:
				lbl_state_OutZone:
				if (!GPIO_ReadInputPin(CarCalibLimit))
				{
					// запуск каретки для вывода из зоны заслонки
					PID_start_man(&pidCar, stepUp);
					
					if (	!GPIO_ReadInputPin(CarNearBtn))
					{
						PID_stop(&pidCar);
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
						//PID_start_man(&pidCar, stepUp);								
					}
				}
				else
				{
					PID_stop_man(&pidCar);
					// переход на следующую стадию автомата
					if (stateCarSlider == state_OutZone)
					{
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
					else
					{
						stateCarSlider--; 
					}
					
				}
				break;
			//--------------------
			case state_SliderClose_OutZone:
				lbl_state_SliderClose_OutZone:
				goto lbl_state_OutZone;
				break;
			//-------------------------------------------------
			case state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone_CarAuto:
				lbl_state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone_CarAuto:
				
			case state_AlarmStart_SrcUp_CarAuto:
				lbl_state_AlarmStart_SrcUp_CarAuto:
				goto lbl_state_CarAutoStart;
				
				break;
				
			case state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone:
				lbl_state_AlarmStart_SrcUp_CarAuto_SliderOpen_OutZone:
				
				goto lbl_state_OutZone;
				
				break;
			case state_AlarmStart_SrcUp_CarAuto_SliderOpen:
				lbl_state_AlarmStart_SrcUp_CarAuto_SliderOpen:
				
				goto lbl_state_SliderOpen;
				
				break;
			
			
			case state_AlarmStart:
				alarm.flag_alm=alarmOn;
				stateCarSlider=stateWaitIdle;
				goto lbl_testIdle;
				break;
				
			case state_AlarmStart_SrcUp:
				lbl_state_AlarmStart_SrcUp:
				
			case state_SrcUp:	
				lbl_state_SrcUp:	
				
				if (GPIO_ReadInputPin(SrcUpLimit))
				{
					PID_start_man(&pidSrc, stepUp);	
					if (!GPIO_ReadInputPin(SrcDownBtn))
					{
						PID_stop(&pidSrc);
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
				}
				else
				{
					PID_stop(&pidSrc);
					if (stateCarSlider == state_SrcUp)
					{
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
					else
					{
						stateCarSlider--;
					}
				}
				
				break;
			
			/*
			case state_SrcDownDist:	
				lbl_state_SrcDownDist:	
				
				if (  !GPIO_ReadInputPin(SrcUpLimit) &&
							PID_getStatePower(&pidSrc) == power_off && 
							PID_getStateRot(&pidSrc)==rot_stop 
						)
				{
					PID_setPV(&pidSrc,
									0);
									
					PID_start_auto(&pidSrc, 
							PID_getPV(&pidSrc)- (int32_t)SrcConvStepIntoDist*(int32_t)SrcDistDown);
					
					if (!GPIO_ReadInputPin(SrcUpBtn))
					{
						PID_stop(&pidSlider);
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
				}
				else
				if (PID_getStatePower(&pidSrc) == power_off
					&& PID_getStateRot(&pidSrc)==rot_stop) 
				{
					
