acc1408/stm8s_osa/main.c
					if ( stateCarSlider == state_SrcDownDist)
					{
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
					else
					{
						stateCarSlider--;
					}
				}
				else
				if (!GPIO_ReadInputPin(SrcUpBtn))
				{
					PID_stop(&pidSlider);
					stateCarSlider=stateWaitIdle;
					goto lbl_testIdle;
				}
				
				break;
			*/
			/*
			case state_SliderOpen_OutZone_SrcDownDist:
				lbl_state_SliderOpen_OutZone_SrcDownDist:
				
			
				goto lbl_state_SrcDownDist;
				break;
			*/
			case state_SliderOpen_OutZone:
				lbl_state_SliderOpen_OutZone:
				
				goto lbl_state_OutZone;
				break;



			case state_SrcDown:	
				lbl_state_SrcDown:	
				
				if (GPIO_ReadInputPin(SrcDownLimit))
				{
					PID_start_man(&pidSrc, stepDown);	
					if (!GPIO_ReadInputPin(SrcUpBtn))
					{
						PID_stop(&pidSrc);
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
				}
				else
				{
					PID_stop(&pidSrc);
					if (stateCarSlider == state_SrcDown)
					{
						stateCarSlider=stateWaitIdle;
						goto lbl_testIdle;
					}
					else
					{
					stateCarSlider--;
					}
				}
				
				break;
			
			
			
			//--------------------------
			case stateWaitIdle:
				// остановка осей
			default:
				PID_stop(&pidCar);
				PID_stop(&pidSlider);
				PID_stop(&pidSrc);
				lbl_testIdle:
				if (PID_getStatePower(&pidCar) == power_off	
						&& PID_getStateRot(&pidCar)==rot_stop)	
				{
					// проверка сохраненных данных
					// Чтение данных из 
					I2Csw_readFromMemoryByte2( &I2Csw_Gpio,
																AT24C32_devAdr,
																save.num*8,
																(uint8_t*)&temp_32,
																4);
					PV_Cur=PID_getPV(&pidCar);
					if (temp_32!=PV_Cur)
					{
						// запись данных
						j=0;
						while(
						I2Csw_sendToMemoryByte2(&I2Csw_Gpio,
																			AT24C32_devAdr,
																			save.num*8,
																			(uint8_t*)&PV_Cur,
																			4) !=I2Csw_success && j++ <maxRepeatWrite );
					}
					// дальнейшая проверка на остановку
					if( PID_getStatePower(&pidSlider) == power_off	
							&& PID_getStateRot(&pidSlider)==rot_stop	
							&& PID_getStatePower(&pidSrc) == power_off	
							&& PID_getStateRot(&pidSrc)==rot_stop	
							)
					{
						stateCarSlider=stateCarSliderIdle;
					}
				}
		}
		
		
		
		
		
		
		//--------------------------------------
		//--------------------
		// кнопки увеличения дистанции
		if ( !GPIO_ReadInputPin(CarAutoDistMinusBtn)  )
		{
			dirDistCarSP=-1;
			goto lbl_setDistSP;
		}
		else	
		if ( !GPIO_ReadInputPin(CarAutoDistPlusBtn)  )
		{
			dirDistCarSP=1;
			lbl_setDistSP: // переход при вычистании
			if (flagDistCarSP)
			{
				if (flagDistCarSP)
				{
					if (incDistCarSP <10)
					{
						incDistCarSP++;
					}
					else
					if (incDistCarSP <100)
					{
						incDistCarSP+=10;
					}
					else
					if (incDistCarSP <1000)
					{
						incDistCarSP+=100;
					}
					/*
					else
					if (incDistCarSP<10000)
					{
						incDistCarSP+=1000;
						//distCarSP+=500;
					}
					*/
					
					// Добавление значений
					
					/*
					if (incDistCarSP >1000)
					{
						distCarSP  =distCarSP + 200*dirDistCarSP;
					}
					else
					*/
					if (incDistCarSP >100)
					{
						distCarSP  =distCarSP + 100*dirDistCarSP;
					}
					else
					if (incDistCarSP >10)
					{
						distCarSP  =distCarSP + 10*dirDistCarSP;
					}
					else
					{
						distCarSP  =distCarSP + dirDistCarSP;
					}
					
					// Проверка на диапазон
					if (distCarSP>maxDistCarSP)
					{
						distCarSP=maxDistCarSP;
					}
					else
					if (distCarSP<minDistCarSP)
					{
						distCarSP=minDistCarSP;
					}
					
					flagDistCarSP=0;
				}
			}
		}
		else
		{
			if (flagDistCarSP)
			{
				// уменьшение счетчика
				/*
				if (incDistCarSP >1000)
				{
					incDistCarSP  =incDistCarSP - 1000;
				}
				else
				*/
				if (incDistCarSP >100)
				{
					incDistCarSP  = incDistCarSP -100;
				}
				else
				if (incDistCarSP >10)
				{
					incDistCarSP  = incDistCarSP -10;
				}
				else
				if (incDistCarSP >0)
				{
					incDistCarSP  =incDistCarSP - 1;
				} 
				else
				{
					incDistCarSP  = 0;
				}
				flagDistCarSP=0;
			}
		}
		
		
		
		/*
		if ( !GPIO_ReadInputPin(CarAutoDistPlusBtn)  )
		{
			if (flagDistCarSP)
			{
				if (incDistCarSP ==0 )
				{
					nop();
					incDistCarSP++;
				}
				else
				if (incDistCarSP <=10)
				{
					incDistCarSP++;
					distCarSP++;
				}
				else
				if (incDistCarSP <=100)
				{
					incDistCarSP+=10;
					distCarSP+=10;
				}
				else
				if (incDistCarSP <=1000)
				{
					incDistCarSP+=100;
					distCarSP+=100;
				}
				else
				{
					//incDistCarSP+=100;
					distCarSP+=500;
				}
				
				if (distCarSP>maxDistCarSP)
					{
						distCarSP=maxDistCarSP;
					}
				flagDistCarSP=0;
			}
		}
		else
		{
			incDistCarSP=0;
		}
		
		if ( !GPIO_ReadInputPin(CarAutoDistMinusBtn)  )
		{
			if (flagDistCarSP)
			{
				if (decDistCarSP ==0 )
				{
					decDistCarSP++;
				}
				else
				if (decDistCarSP <=10)
				{
					decDistCarSP++;
					distCarSP--;
				}
				else
				if (decDistCarSP <=100)
				{
					decDistCarSP+=10;
					distCarSP-=10;
				}
				else
				if (decDistCarSP <=1000)
				{
					decDistCarSP+=100;
					distCarSP-=100;
				}
				else
				{
					//incDistCarSP+=100;
					distCarSP-=500;
				}
				
				if (distCarSP<0)
					{
						distCarSP=0;
					}
				flagDistCarSP=0;
			}
		}
		else
		{
			decDistCarSP=0;
		}
		
		*/
		
		
		//-----------------------------------
		//===================================
		// Затвор
		
		//--------------------
		// опрос кнопок таймера
		if (flagPollingTimeBtn)
		{
			if ( !GPIO_ReadInputPin(SliderHourPlusBtn))
			{
				if ( flagFastHourPlus<edgeFastHour)
				{
				alarm.hour_alm++;
				flagFastHourPlus++;
				}
				else
				{
					alarm.hour_alm+=edgeFastHour;
				}
				
				if (alarm.hour_alm>24)
				{
					//alarm.hour_alm=alarm.hour_alm%24;
					alarm.hour_alm=24;
				}
				
				
			}
			else
			{
				flagFastHourPlus=0;
			}
			
			
			if ( !GPIO_ReadInputPin(SliderHourMinusBtn))
			{
				
				if ( flagFastHourMinus < edgeFastHour)
				{
					alarm.hour_alm--;
					flagFastHourMinus++;
				}
				else
				{
					alarm.hour_alm-=edgeFastHour;
				}
				
				
				if (alarm.hour_alm<0)
				{
					//alarm.hour_alm=24+alarm.hour_alm;
					alarm.hour_alm=0;
				}
			}
			else
			{
				flagFastHourMinus=0;
			}
			
			
			if ( !GPIO_ReadInputPin(SliderMinutePlusBtn))
			{
				
				
				
				if ( flagFastMinutePlus<edgeFastMinute)
				{
				alarm.min_alm++;
				flagFastMinutePlus++;
				}
				else
				{
					alarm.min_alm+=edgeFastMinute;
				}
				
				if (alarm.min_alm>59)
				{
					//alarm.min_alm=alarm.min_alm%60;
					alarm.min_alm=59;
				}
				
