acc1408/stm8s_osa/main.c
			}
			else
			{
				flagFastMinutePlus=0;
			}
			
			if ( !GPIO_ReadInputPin(SliderMinuteMinusBtn))
			{
				if ( flagFastMinuteMinus<edgeFastMinute)
				{
				alarm.min_alm--;
				flagFastMinuteMinus++;
				}
				else
				{
					alarm.min_alm-=edgeFastMinute;
				}
				
				if (alarm.min_alm<0)
				{
					//alarm.min_alm=60+alarm.min_alm;
					alarm.min_alm=0;
				}
			}
			else
			{
				flagFastMinuteMinus=0;
			}
			//---------
			// вывод данных на экран
			alarm.s_alm= (uint32_t)alarm.hour_alm*3600+(uint32_t)alarm.min_alm*60;
			sprintf(st,"%02d:%02d", (int16_t)alarm.hour_alm, (int16_t)alarm.min_alm);
			TM1637_4digit_TextOutput(&dispTimerAlarm,st);
			flagPollingTimeBtn=0;
		}
		// конец блока настройки будильника
		
		
		
		
		if ( !GPIO_ReadInputPin(SliderTimeStartBtn))
		{
			nop();
		}
		//-----------------------
		// Запуск таймера и обновление экрана
		if ( !GPIO_ReadInputPin(SliderOpenLimit) )
		{
			
			switch(sliderTimer)
			{
				case sliderTimerStop:
					I2Csw_sendToMemoryByte1(&I2Csw_Gpio,
																		DS3231_devAdr,
																		0,
																		DS3231_reg,
																		4);
				case sliderTimerRun:
					lbl_timerRun:
					// обновление часов
					if ( !GPIO_ReadInputPin( SrcUpLimit))
					{
						I2Csw_readFromMemoryByte1(&I2Csw_Gpio,
																			DS3231_devAdr,
																			0,
																			DS3231_reg,
																			4);
						SoftTimer_CMD(&softTimerUpdate,
											ENABLE);
					}
					else
					{
						I2Csw_sendToMemoryByte1(&I2Csw_Gpio,
																		DS3231_devAdr,
																		0,
																		DS3231_reg,
																		4);
						//Отключаем обновление экрана
						SoftTimer_CMD(&softTimerUpdate,
										DISABLE);
						// Останавливаем монитор с символом :
						//timerUpdateDisplay=0;				
					}
				
					sliderTimer=sliderTimerRun;
					break;
				case sliderTimerHold:
						lbl_timerHold:
						DS3231_reg[0]=0; // секунды
						DS3231_reg[1]=0; // минуты 
						DS3231_reg[2]=0; // часы
						DS3231_reg[3]=1; // дни 
						I2Csw_sendToMemoryByte1(&I2Csw_Gpio,
																		DS3231_devAdr,
																		0,
																		DS3231_reg,
																		4);
					
						sliderTimer=sliderTimerRun;
						break;
				case sliderTimerInit:
					// добавить переход для проверки состояния источника
					if ( !GPIO_ReadInputPin( SrcUpLimit))
					{
						goto lbl_timerRun;
					}
					else
					{
						goto lbl_timerHold;
					}					
					break;		
			}
		}
		else
		if ( !GPIO_ReadInputPin(SliderCloseLimit) )
		{
			switch(sliderTimer)
			{
				case sliderTimerHold:
					break;
				case sliderTimerStop:		
				case sliderTimerInit:
				case sliderTimerRun:
					sliderTimer=sliderTimerHold;
					SoftTimer_CMD(&softTimerUpdate,
										DISABLE);
					//timerUpdateDisplay=0;	
					break;	
			}
		}
		else
		{
			switch(sliderTimer)
			{
				case sliderTimerStop:
					//break;	
				
				case sliderTimerHold:	
					break;
					
				case sliderTimerRun:
					sliderTimer=sliderTimerStop;
					SoftTimer_CMD(&softTimerUpdate,
										DISABLE);
					//timerUpdateDisplay=0;	
					break;
				
				case sliderTimerInit:
					
					if ( !GPIO_ReadInputPin( SrcUpLimit))
					{
						sliderTimer=sliderTimerStop;
					}
					else
					{
						sliderTimer=sliderTimerHold;
					}
					SoftTimer_CMD(&softTimerUpdate,
										DISABLE);
					//timerUpdateDisplay=0;	
					break;
			}
			
		}
		// Конец обновления таймера
		//-------------------------------
		//================================
		//	

		if ( !GPIO_ReadInputPin( StopBtn))
		{
			nop();
			GPIO_WriteHigh(StopL);
			GPIO_WriteLow(enStep1);
			GPIO_WriteLow(enStep2);
			GPIO_WriteLow(enStepSrc_3);
			while(1);
		}
	
		
		if ( !GPIO_ReadInputPin( AlmStep))
		{
			// состояние ошибки
			nop();
			// отключение двигателя
			GPIO_WriteLow(enStep1);
			SoftTimer_CMD(&softTimerBlinkError,ENABLE);
			// переключаемся в режим сброса координат
			
		}
		else
		{
			nop();
			// включение двигателя
			GPIO_WriteHigh(enStep1);
			//GPIO_WriteHigh(enStepSrc_3);
		}
		
		// Конец автомата управления источником
	}
#endif
}

#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
